Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/getting_started_pic32ck_gc01_cult/firmware/src/packs/PIC32CK2051GC01144_DFP/component/supc.h
/* -------- SUPC_INTENSET : (SUPC Offset: 0x04) (R/W 32) Interrupt Enable Set -------- */
#define SUPC_INTENSET_RESETVALUE              _UINT32_(0x00)                                       /*  (SUPC_INTENSET) Interrupt Enable Set  Reset Value */

#define SUPC_INTENSET_LVDET_Pos               _UINT32_(0)                                          /* (SUPC_INTENSET) Low Voltage Detector Interrupt Enable Position */
#define SUPC_INTENSET_LVDET_Msk               (_UINT32_(0x1) << SUPC_INTENSET_LVDET_Pos)           /* (SUPC_INTENSET) Low Voltage Detector Interrupt Enable Mask */
#define SUPC_INTENSET_LVDET(value)            (SUPC_INTENSET_LVDET_Msk & (_UINT32_(value) << SUPC_INTENSET_LVDET_Pos)) /* Assigment of value for LVDET in the SUPC_INTENSET register */
#define SUPC_INTENSET_LVDRDY_Pos              _UINT32_(1)                                          /* (SUPC_INTENSET) Low Voltage Detector Ready Interrupt Enable Position */
#define SUPC_INTENSET_LVDRDY_Msk              (_UINT32_(0x1) << SUPC_INTENSET_LVDRDY_Pos)          /* (SUPC_INTENSET) Low Voltage Detector Ready Interrupt Enable Mask */
#define SUPC_INTENSET_LVDRDY(value)           (SUPC_INTENSET_LVDRDY_Msk & (_UINT32_(value) << SUPC_INTENSET_LVDRDY_Pos)) /* Assigment of value for LVDRDY in the SUPC_INTENSET register */
#define SUPC_INTENSET_ULDORDY_Pos             _UINT32_(2)                                          /* (SUPC_INTENSET) User LDO Regulator Ready Interrupt Enable Position */
#define SUPC_INTENSET_ULDORDY_Msk             (_UINT32_(0x1) << SUPC_INTENSET_ULDORDY_Pos)         /* (SUPC_INTENSET) User LDO Regulator Ready Interrupt Enable Mask */
#define SUPC_INTENSET_ULDORDY(value)          (SUPC_INTENSET_ULDORDY_Msk & (_UINT32_(value) << SUPC_INTENSET_ULDORDY_Pos)) /* Assigment of value for ULDORDY in the SUPC_INTENSET register */
#define SUPC_INTENSET_ULDOOVHEAT_Pos          _UINT32_(3)                                          /* (SUPC_INTENSET) User LDO Regulator OverHeat Interrupt Enable Position */
#define SUPC_INTENSET_ULDOOVHEAT_Msk          (_UINT32_(0x1) << SUPC_INTENSET_ULDOOVHEAT_Pos)      /* (SUPC_INTENSET) User LDO Regulator OverHeat Interrupt Enable Mask */
#define SUPC_INTENSET_ULDOOVHEAT(value)       (SUPC_INTENSET_ULDOOVHEAT_Msk & (_UINT32_(value) << SUPC_INTENSET_ULDOOVHEAT_Pos)) /* Assigment of value for ULDOOVHEAT in the SUPC_INTENSET register */
#define SUPC_INTENSET_BORVDDIOB_Pos           _UINT32_(4)                                          /* (SUPC_INTENSET) BORVDDIOB Interrupt Enable Position */
#define SUPC_INTENSET_BORVDDIOB_Msk           (_UINT32_(0x1) << SUPC_INTENSET_BORVDDIOB_Pos)       /* (SUPC_INTENSET) BORVDDIOB Interrupt Enable Mask */
#define SUPC_INTENSET_BORVDDIOB(value)        (SUPC_INTENSET_BORVDDIOB_Msk & (_UINT32_(value) << SUPC_INTENSET_BORVDDIOB_Pos)) /* Assigment of value for BORVDDIOB in the SUPC_INTENSET register */
#define SUPC_INTENSET_BORVDDUSB_Pos           _UINT32_(5)                                          /* (SUPC_INTENSET) BORVDDUSB Interrupt Enable Position */
#define SUPC_INTENSET_BORVDDUSB_Msk           (_UINT32_(0x1) << SUPC_INTENSET_BORVDDUSB_Pos)       /* (SUPC_INTENSET) BORVDDUSB Interrupt Enable Mask */
#define SUPC_INTENSET_BORVDDUSB(value)        (SUPC_INTENSET_BORVDDUSB_Msk & (_UINT32_(value) << SUPC_INTENSET_BORVDDUSB_Pos)) /* Assigment of value for BORVDDUSB in the SUPC_INTENSET register */
#define SUPC_INTENSET_ADDVREGRDY0_Pos         _UINT32_(8)                                          /* (SUPC_INTENSET) Additional Regulator ready 0 Interrupt Enable Position */
#define SUPC_INTENSET_ADDVREGRDY0_Msk         (_UINT32_(0x1) << SUPC_INTENSET_ADDVREGRDY0_Pos)     /* (SUPC_INTENSET) Additional Regulator ready 0 Interrupt Enable Mask */
#define SUPC_INTENSET_ADDVREGRDY0(value)      (SUPC_INTENSET_ADDVREGRDY0_Msk & (_UINT32_(value) << SUPC_INTENSET_ADDVREGRDY0_Pos)) /* Assigment of value for ADDVREGRDY0 in the SUPC_INTENSET register */
#define SUPC_INTENSET_Msk                     _UINT32_(0x0000013F)                                 /* (SUPC_INTENSET) Register Mask  */

#define SUPC_INTENSET_ADDVREGRDY_Pos          _UINT32_(8)                                          /* (SUPC_INTENSET Position) Additional Regulator ready x Interrupt Enable */
#define SUPC_INTENSET_ADDVREGRDY_Msk          (_UINT32_(0x1) << SUPC_INTENSET_ADDVREGRDY_Pos)      /* (SUPC_INTENSET Mask) ADDVREGRDY */
#define SUPC_INTENSET_ADDVREGRDY(value)       (SUPC_INTENSET_ADDVREGRDY_Msk & (_UINT32_(value) << SUPC_INTENSET_ADDVREGRDY_Pos)) 

/* -------- SUPC_INTFLAG : (SUPC Offset: 0x08) (R/W 32) Interrupt Flag Status and Clear -------- */
#define SUPC_INTFLAG_RESETVALUE               _UINT32_(0x00)                                       /*  (SUPC_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define SUPC_INTFLAG_LVDET_Pos                _UINT32_(0)                                          /* (SUPC_INTFLAG) Low Voltage Detector Interrupt. Set to one if VDDIO crosses the treshold voltage in the good direction according to LVD.DIR. Position */
#define SUPC_INTFLAG_LVDET_Msk                (_UINT32_(0x1) << SUPC_INTFLAG_LVDET_Pos)            /* (SUPC_INTFLAG) Low Voltage Detector Interrupt. Set to one if VDDIO crosses the treshold voltage in the good direction according to LVD.DIR. Mask */
#define SUPC_INTFLAG_LVDET(value)             (SUPC_INTFLAG_LVDET_Msk & (_UINT32_(value) << SUPC_INTFLAG_LVDET_Pos)) /* Assigment of value for LVDET in the SUPC_INTFLAG register */
#define SUPC_INTFLAG_LVDRDY_Pos               _UINT32_(1)                                          /* (SUPC_INTFLAG) Low Voltage Detector Ready Interrupt. Set to one if LVD is ready to operate. Position */
#define SUPC_INTFLAG_LVDRDY_Msk               (_UINT32_(0x1) << SUPC_INTFLAG_LVDRDY_Pos)           /* (SUPC_INTFLAG) Low Voltage Detector Ready Interrupt. Set to one if LVD is ready to operate. Mask */
#define SUPC_INTFLAG_LVDRDY(value)            (SUPC_INTFLAG_LVDRDY_Msk & (_UINT32_(value) << SUPC_INTFLAG_LVDRDY_Pos)) /* Assigment of value for LVDRDY in the SUPC_INTFLAG register */
#define SUPC_INTFLAG_ULDORDY_Pos              _UINT32_(2)                                          /* (SUPC_INTFLAG) User LDO Regulator Ready Interrupt. Set to one if ULDO is ready meaning that output voltage is correct. Position */
#define SUPC_INTFLAG_ULDORDY_Msk              (_UINT32_(0x1) << SUPC_INTFLAG_ULDORDY_Pos)          /* (SUPC_INTFLAG) User LDO Regulator Ready Interrupt. Set to one if ULDO is ready meaning that output voltage is correct. Mask */
#define SUPC_INTFLAG_ULDORDY(value)           (SUPC_INTFLAG_ULDORDY_Msk & (_UINT32_(value) << SUPC_INTFLAG_ULDORDY_Pos)) /* Assigment of value for ULDORDY in the SUPC_INTFLAG register */
#define SUPC_INTFLAG_ULDOOVHEAT_Pos           _UINT32_(3)                                          /* (SUPC_INTFLAG) User LDO Regulator OverHeat Interrupt. Is set to one if overheat condition is detected. Position */
#define SUPC_INTFLAG_ULDOOVHEAT_Msk           (_UINT32_(0x1) << SUPC_INTFLAG_ULDOOVHEAT_Pos)       /* (SUPC_INTFLAG) User LDO Regulator OverHeat Interrupt. Is set to one if overheat condition is detected. Mask */
#define SUPC_INTFLAG_ULDOOVHEAT(value)        (SUPC_INTFLAG_ULDOOVHEAT_Msk & (_UINT32_(value) << SUPC_INTFLAG_ULDOOVHEAT_Pos)) /* Assigment of value for ULDOOVHEAT in the SUPC_INTFLAG register */
#define SUPC_INTFLAG_BORVDDIOB_Pos            _UINT32_(4)                                          /* (SUPC_INTFLAG) BORVDDIOB Interrupt. Set to one if VDDIOB issue is detected. Position */
#define SUPC_INTFLAG_BORVDDIOB_Msk            (_UINT32_(0x1) << SUPC_INTFLAG_BORVDDIOB_Pos)        /* (SUPC_INTFLAG) BORVDDIOB Interrupt. Set to one if VDDIOB issue is detected. Mask */
#define SUPC_INTFLAG_BORVDDIOB(value)         (SUPC_INTFLAG_BORVDDIOB_Msk & (_UINT32_(value) << SUPC_INTFLAG_BORVDDIOB_Pos)) /* Assigment of value for BORVDDIOB in the SUPC_INTFLAG register */
#define SUPC_INTFLAG_BORVDDUSB_Pos            _UINT32_(5)                                          /* (SUPC_INTFLAG) BORVDDUSB Interrupt. Set to one if VDDUSB issue is detected. Position */
#define SUPC_INTFLAG_BORVDDUSB_Msk            (_UINT32_(0x1) << SUPC_INTFLAG_BORVDDUSB_Pos)        /* (SUPC_INTFLAG) BORVDDUSB Interrupt. Set to one if VDDUSB issue is detected. Mask */
#define SUPC_INTFLAG_BORVDDUSB(value)         (SUPC_INTFLAG_BORVDDUSB_Msk & (_UINT32_(value) << SUPC_INTFLAG_BORVDDUSB_Pos)) /* Assigment of value for BORVDDUSB in the SUPC_INTFLAG register */
#define SUPC_INTFLAG_ADDVREGRDY0_Pos          _UINT32_(8)                                          /* (SUPC_INTFLAG) Additional Regulator ready 0 Interrupt. Set to one if additionnal regulator is ready meaning that output voltage is correct. Position */
#define SUPC_INTFLAG_ADDVREGRDY0_Msk          (_UINT32_(0x1) << SUPC_INTFLAG_ADDVREGRDY0_Pos)      /* (SUPC_INTFLAG) Additional Regulator ready 0 Interrupt. Set to one if additionnal regulator is ready meaning that output voltage is correct. Mask */
#define SUPC_INTFLAG_ADDVREGRDY0(value)       (SUPC_INTFLAG_ADDVREGRDY0_Msk & (_UINT32_(value) << SUPC_INTFLAG_ADDVREGRDY0_Pos)) /* Assigment of value for ADDVREGRDY0 in the SUPC_INTFLAG register */
#define SUPC_INTFLAG_Msk                      _UINT32_(0x0000013F)                                 /* (SUPC_INTFLAG) Register Mask  */

#define SUPC_INTFLAG_ADDVREGRDY_Pos           _UINT32_(8)                                          /* (SUPC_INTFLAG Position) Additional Regulator ready x Interrupt. Set to one if additionnal regulator is ready meaning that output voltage is correct. */
#define SUPC_INTFLAG_ADDVREGRDY_Msk           (_UINT32_(0x1) << SUPC_INTFLAG_ADDVREGRDY_Pos)       /* (SUPC_INTFLAG Mask) ADDVREGRDY */
#define SUPC_INTFLAG_ADDVREGRDY(value)        (SUPC_INTFLAG_ADDVREGRDY_Msk & (_UINT32_(value) << SUPC_INTFLAG_ADDVREGRDY_Pos)) 

